# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

arr = [59,86,75,3,8,41,7]
arr2 = []  
for i in arr:
    while i >= len(arr) / 2:
        arr2 = arr[0] * arr[-1]
        print(arr2)
        arr.remove(arr[0]) 
        arr.remove(arr[-1]) 
        